
   //____________________________________________________________
   // Объявляем класс Balance, который хранит данные о балансах
   // пользователей и содержит методы работы с ними
    public class Balance {
    //____________________________________________________________

    //____________________________________________________________
    // Создаем приватную переменную delBalance типа double,
    // которая будет хранить криптовалютный баланс с монетой Del
    private double delBalance;
    private double rubBalance;
    private double spentMoney;
    //____________________________________________________________

    //____________________________________________________________
    // Создаем конструктор с двумя параметрами, которые являются начальными балансами пользователя
    public Balance(double delBalance, double rubBalance) {
        this.delBalance = delBalance;
        this.rubBalance = rubBalance;
        this.spentMoney = 0; // Начальное значение spentMoney равно 0
    }
        //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который возвращает значение delBalance
        public double getDelBalance() {
        return delBalance;
        }
        //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который устанавливает значение rubBalance
        public void setRubBalance(double rubBalance) {
        this.rubBalance = rubBalance;
        }
       //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который устанавливает значение delBalance
        public void setDelBalance(double delBalance) {
        this.delBalance = delBalance;
        }
       //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который устанавливает значение spentMoney
        public void setSpentMoney(double spentMoney) {
        this.spentMoney = spentMoney;
        }
       //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который возвращает значение rubBalance
        public double getRubBalance() {
        return rubBalance;
        }
       //____________________________________________________________

        //____________________________________________________________
        // Создаем метод, который возвращает значение spentMoney
        public double getSpentMoney() {
        return spentMoney;
        }
       //____________________________________________________________

//____________________________________________________________
//_ Конец программы
}
//____________________________________________________________
