//__________________________________________________________
// Импортируем библиотеку Scanner
// из пакета java.util для получения пользовательского ввода
import java.util.Scanner;
// __________________________________________________________


//___________________________________________________________
//Область исполнения кода программы)
//Здесь будут построчно исполняться строки кода
// Программа будет вызывать классы, функции и методы

public class Main {
        public static void main(String[] args) {

            //__________________________________________________________
            // Создаем объект Scanner
            // для считывания пользовательского ввода из консоли
        Scanner scanner = new Scanner(System.in);
        System.out.print("Как вас зовут? "); // Запрашиваем имя пользователя
        String name = scanner.nextLine(); // Считываем имя пользователя
        User user = new User(name); // Создаем объект User с именем пользователя
        //___________________________________________________________

        //___________________________________________________________
        // Создаем объект TraderAssistant
        // с именем пользователя и приветствуем его
        TraderAssistant assistant = new TraderAssistant(name);
        //___________________________________________________________

        //___________________________________________________________
        // Вызываем приветствие пользователя
        assistant.greetUser();
        //___________________________________________________________

        //___________________________________________________________
        // Запрашиваем фиатный баланс пользователя
        System.out.print("Введите текущий фиатный депозит в рублях: ");
        double rubBalance = scanner.nextDouble();
        scanner.nextLine();
        //___________________________________________________________

        //___________________________________________________________
        // Запрашиваем баланс монет
        // DEL пользователя
        System.out.print("Введите количество монет DEL, " +
                "которые у вас уже закуплены: ");
        double delBalance = scanner.nextDouble();
        scanner.nextLine();
        //___________________________________________________________

        //___________________________________________________________
        // Запрашиваем количество денег,
        // которые были потрачены на покупку монет DEL
        System.out.print("Введите количество денег, " +
                "которые были потрачены на закупку монет: ");
        double spentMoney = scanner.nextDouble();
        scanner.nextLine();
        //___________________________________________________________

        //___________________________________________________________
        // Создаем объект Balance с начальными балансами пользователя
        Balance balance = new Balance(delBalance, rubBalance);
        //___________________________________________________________

        //___________________________________________________________
        // Создаем объект Statistics для отслеживания статистики
        Statistics statistics = new Statistics(balance);
        //___________________________________________________________

        //___________________________________________________________
        // Создаем объект PortfolioManagement для управления портфелем
        PortfolioManagement portfolioManagement = new
                PortfolioManagement(balance, null);
        //___________________________________________________________

        //___________________________________________________________
        // Создаем объект ProfitCalculation для расчета прибыли
        ProfitCalculation profitCalculation = new
                ProfitCalculation(balance, null);
        //___________________________________________________________

        //___________________________________________________________
        int choice = 0; // Инициализируем переменную choice
        //___________________________________________________________


            //___________________________________________________________
            // Запускаем бесконечный цикл
            // цикл while, который будет работать,
            // пока пользователь не выберет выход из программы
            while (choice != 5) {
            printMenu(); // Выводим на экран меню доступных действий
            System.out.print("Выберите действие: ");
            choice = scanner.nextInt(); // Считываем выбор пользователя
            scanner.nextLine(); // Считываем лишний перевод строки из буфера
            //_____________________________________________________________

                 //_________________________________________________________
                 switch (choice) { //Исполнение команд из коносли

                     //___________________________________________________________
                     // Посмотреть баланс
                     case 1:
                     System.out.println("Ваш баланс:");
                     System.out.println("DEL: " + balance.getDelBalance());
                     System.out.println("RUB: " + balance.getRubBalance());
                     break;
                     //___________________________________________________________

                     // ____________________________________________________
                     // Управление портфелем
                     case 2:
                     portfolioManagement.managePortfolio();
                     break;
                     // ____________________________________________________

                     // ____________________________________________________
                     // Статистика
                     case 3:
                     statistics.showStatistics();
                     break;
                     // ____________________________________________________

                     // ____________________________________________________
                     // Расчет прибыли
                     case 4:
                     profitCalculation.calculateProfit();
                     break;
                     // ____________________________________________________

                     //____________________________________________________
                     // Выход
                     case 5:
                     System.out.println("До свидания!");
                     break;
                     // ____________________________________________________

                     // ____________________________________________________
                     // Некорректный выбор
                     default:
                     System.out.println("Некорректный выбор.");
                     break;
                     // ____________________________________________________

                     // ____________________________________________________
                     // Закрытие областей видимости и работы программ
                     }
                     }
                     }
                      // ____________________________________________________

    // ____________________________________________________
    // Вспомогательный метод (функция) для печати меню
    public static void printMenu() {
        System.out.println("=================");
        System.out.println("Меню:");
        System.out.println("1. Посмотреть баланс");
        System.out.println("2. Записать сделку");
        System.out.println("3. Статистика");
        System.out.println("4. Расчет прибыли");
        System.out.println("5. Выход");
        System.out.println("=================");
        // ____________________________________________________


        // ____________________________________________________
        // Закрытие областей видимости и работы программ
        }
        }
        // ____________________________________________________

//___________________
// Конец программы
//___________________


